#include <iostream>

using namespace std;
    
int main() {
    int n;
    cin >> n;
    cout << (n/2)*2+2;
}

/*
На вход дается натуральное число N. 
Выведите следующее за ним четное число
(На вход дается целое положительное число N, 
не превышающее 10000.)
*/
